tap "athevon/tokeneater"
tap "bgreenwell/xleak"
tap "buo/cask-upgrade"
tap "cola-runner/tap"
tap "dmno-dev/tap"
tap "f/textream"
tap "farion1231/ccswitch"
tap "felixkratz/formulae"
tap "homebrew/cask"
tap "homebrew/core"
tap "iordv/tap"
tap "jazzyalex/agent-sessions"
tap "jhlee0409/tap"
tap "joknarf/tools"
tap "jundot/omlx", "https://github.com/jundot/omlx"
tap "k06a/tap"
tap "kde/kde"
tap "lbjlaq/antigravity-manager", "https://github.com/lbjlaq/Antigravity-Manager"
tap "lihaoyun6/tap"
tap "lzt1008/powerflow"
tap "nguyenphutrong/tap"
tap "otuerk/sidebar"
tap "oven-sh/bun"
tap "rana-gmbh/netfluss"
tap "roblibob/minute"
tap "touch-tap/tap"
tap "tw93/tap"
tap "unsecretised/tap"
tap "wyattjoh/stable"
tap "yakitrak/yakitrak"
# Simple, modern, secure file encryption
brew "age"
# Asciicast to GIF converter
brew "agg"
# Record and share terminal sessions
brew "asciinema"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Organization lookup and server tool (ASN / IPv4 / IPv6 / Prefix / AS Path)
brew "asn"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Analyzes ELF binaries
brew "binsider"
# Toolchain of the web
brew "biome"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# CLI tool for analyzing Claude Code usage from local JSONL files
brew "ccusage"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Tool to route Claude Code requests to different models and customize any request
brew "claude-code-router"
# Cut, copy, and paste anything, anywhere, all from the terminal
brew "clipboard"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# CPU architecture fetching tool
brew "cpufetch"
# List system USB buses and devices
brew "cyme"
# Pluggable and configurable code formatting platform written in Rust
brew "dprint"
# Command-line tool to download release assets from GitHub
brew "dra"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Command-line batch renaming tool
brew "f2"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# CLI for Drive, Gmail, Calendar, Sheets, Docs, Chat, Admin, and more
brew "googleworkspace-cli"
# Ping, but with a graph
brew "gping"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Toolkit for creating graphical user interfaces
brew "gtk4"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# JQ clone focussed on correctness, speed, and simplicity
brew "jaq"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Fast, async, resource-friendly link checker
brew "lychee"
# Sudoless performance monitoring for Apple Silicon processors
brew "macmon"
# Mac App Store command-line interface
brew "mas"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Command-line tool to view objects (JSON/YAML/TOML) in TUI tree widget
brew "otree"
# Painless compression and decompression for your terminal
brew "ouch"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# CLI for Playwright: record/generate code, inspect selectors, take screenshots
brew "playwright-cli"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# Python package management tool
brew "poetry"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Modern replacement for ps written in Rust
brew "procs"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Rsync for cloud storage
brew "rclone"
# Pack repository contents into a single AI-friendly file
brew "repomix"
# Utility that provides fast incremental file transfer
brew "rsync"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Markdown Linter and Formatter written in Rust
brew "rumdl"
# Rust toolchain installer
brew "rustup"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Autoformat shell script source code
brew "shfmt"
# SMART hard drive monitoring
brew "smartmontools"
# Cross-platform application to monitor your network traffic
brew "sniffnet"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# TOML toolkit written in Rust
brew "taplo"
# Telegram Messenger downloader/tools written in Golang
brew "telegram-downloader"
# General purpose fuzzy finder TUI
brew "television"
# Extremely fast LaTeX formatter written in Rust
brew "tex-fmt"
# Official tldr client written in Rust
brew "tlrc"
# Upgrade all the things
brew "topgrade"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Add declarative schema to .env files using @env-spec decorator comments
brew "varlock"
# CSV CLI magician written in Rust
brew "xan"
# Terminal Excel viewer with an interactive TUI
brew "xleak"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Flexible and fast Zsh plugin manager
brew "zinit"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Claude Code History Viewer - WebUI Server (headless HTTP server)
brew "jhlee0409/tap/cchv-server"
# process tree search
brew "joknarf/tools/pgtree"
# LLM inference server optimized for Apple Silicon
brew "jundot/omlx/omlx"
# Real-time power consumption monitor for Apple Silicon Macs
brew "k06a/tap/macpow"
# Modernized, complete, self-contained TeX/LaTeX engine
brew "local/old-tectonic/tectonic@0.15.0"
# Comprehensive macOS cleanup and application uninstall tool
brew "tw93/tap/mole"
brew "yakitrak/yakitrak/obsidian-cli"
# Batch file renaming utility
cask "advanced-renamer"
# Unified session browser for Codex CLI, Claude Code, Gemini CLI, and OpenCode (read-only)
cask "jazzyalex/agent-sessions/agent-sessions"
# Get the battery level of all your devices on your Mac.
cask "lihaoyun6/tap/airbattery"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Android SDK component
cask "android-platform-tools"
# AI Coding Agent IDE
cask "antigravity"
# Professional Account Management for AI Services
cask "lbjlaq/antigravity-manager/antigravity-tools"
# Application uninstaller
cask "appcleaner"
# Audio utility
cask "background-music"
# Display management tool
cask "betterdisplay"
# Virtual Audio Driver
cask "blackhole-2ch"
# File manager
cask "bloom"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Screen recording software
cask "cap"
# Configuration manager for AI coding agents
cask "cc-switch"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Desktop client that supports multiple LLM providers
cask "cherry-studio"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Menu bar notifications for Claude Code sessions
cask "touch-tap/tap/claude-code-notifier"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Cross-platform Text Expander written in Rust
cask "espanso"
# Per-application volume mixer, equalizer, and audio router
cask "finetune"
# Web browser
cask "firefox"
cask "font-fontawesome"
cask "font-liberation-nerd-font"
cask "font-sketchybar-app-font"
cask "font-tex-gyre-termes"
# Audio player
cask "foobar2000"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Free and open-source image editor
cask "gimp"
# CLI for GitKraken
cask "gitkraken-cli"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Tool for multi-language users
cask "input-source-pro"
# Menu bar manager
cask "jordanbaird-ice"
# Pie menu
cask "kando"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Open-source keystroke visualiser
cask "keycastr"
# Audio tagger focusing on efficiency
cask "kid3"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Discover, download, and run local LLMs
cask "lm-studio"
# Software for Logitech devices
cask "logi-options+"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Clipboard manager
cask "maccy"
# Minimal macOS menubar app showing real-time network upload and download rates
cask "rana-gmbh/netfluss/netfluss"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# macOS App for monitoring power usage and charging status
cask "lzt1008/powerflow/powerflow"
# Graphical user interface for the 'defaults' command
cask "prefs-editor"
# Command center for AI coding assistants on macOS
cask "nguyenphutrong/tap/quotio"
# Archive manager for data compression and backups
cask "rar"
# Application and utility launcher
cask "rustcast"
# Open source virtual/remote desktop application
cask "rustdesk"
# Sidebar - The most customizable Dock replacement for macOS
cask "otuerk/sidebar/sidebar"
# Snip or pin screenshots
cask "snipaste"
# Dictation and transcription app with AI-powered editing
cask "spokenly"
# Rime input method engine
cask "squirrel-app"
# System monitor for the menu bar
cask "stats"
# Control windows and applications right from your trackpad
cask "swish"
# Tool to explore all the running tasks (processes)
cask "taskexplorer"
# macOS teleprompter that highlights your script in real-time as you speak
cask "f/textream/textream"
# Temperature monitoring, fan control and diagnostics
cask "tg-pro"
# Monitor your Claude AI usage limits from macOS desktop
cask "athevon/tokeneater/tokeneater"
# Pin any window to the top of your screen.
cask "lihaoyun6/tap/topit"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
# Window manager
cask "wins"
mas "1001 Record", id: 6451834996
mas "AmorphousDiskMark", id: 1168254295
mas "Amphetamine", id: 937984704
mas "Clip Hold", id: 6748125479
mas "Code Peek+", id: 6760186407
mas "Dropover", id: 1355679052
mas "JobSnail", id: 6449959070
mas "PixelTidy", id: 6756529033
mas "PreviewText", id: 1660037028
mas "sing-box", id: 6673731168
mas "Snippety", id: 1530751461
mas "TraceBar", id: 6760156527
mas "Xcode", id: 497799835
vscode "anthropic.claude-code"
vscode "google-workspace.google-workspace-developer-tools"
cargo "cargo-binstall"
cargo "cargo-cache"
cargo "cargo-update"
uv "notebooklm-mcp-server"
